package bg.tu_varna.sit.f24621646.project_oop1.contracts;
/**
 * @author Vahan
 * Интерфейс, който трябва да бъде имплементиран от всички команди в системата.
 * Дефинира методи за изпълнение на логиката и за предоставяне на помощна информация.
 *
 */
public interface Command {
    /**
     * Изпълнява логиката на командата въз основа на подадените аргументи.
     * Връща текстово съобщение за резултата от изпълнението.
     */
    String execute(String[] args);
    /**
     * Връща начина на употреба на командата.
     */
    String getUsage();
    /**
     * Връща кратко описание на действието, което извършва командата.
     *
     */
    String getDetails();
}
